app/views/groups/index.html.erb

        <td><%= group.users_id %></td>
        <td><%= group.groups_id %></td>
---
SELECT "groups".* FROM "groups"