app/views/users/_form.html.erb

    <%= f.fields_for :group_users do |gu| %>
      <%= gu.select :id, @group.all.map{|g| [g.group_name,g.id]} %>
---
SELECT "groups".* FROM "groups"