app/controllers/groups_controller.rb

INSERT INTO "groups" ("created_at", "group_id", "group_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-17 05:32:17.359515"], ["group_id", 1], ["group_name", "テストグループ"], ["updated_at", "2015-02-17 05:32:17.359515"]]
---
  def create
    @group = Group.new(group_params)
    @group[:group_id] = 1
    respond_to do |format|
      if @group.save

UPDATE "groups" SET "group_id" = ?, "group_name" = ?, "updated_at" = ? WHERE "groups"."id" = 1  [["group_id", 2], ["group_name", "テストグループ2"], ["updated_at", "2015-02-17 05:44:43.412862"]]
---
  def update
    @group[:group_id] = @group[:group_id].blank? ? 1 : @group[:group_id] + 1
    respond_to do |format|
      if @group.update(group_params)