app/controllers/minuts_controller.rb

SELECT "minuts".* FROM "minuts"
---
  def index
    @minuts = Minut.all

INSERT INTO "minuts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "ああああ"], ["created_at", "2015-02-17 06:17:52.638902"], ["title", "さああ"], ["updated_at", "2015-02-17 06:17:52.638902"]]
---
  def create
    @minut = Minut.new(minut_params)
    user_id = params[:minut][:id]
    user = User.find(user_id)
    @minut.minuti_details.build(user_id: user)

    @users = User.all
    respond_to do |format|
      if @minut.save

UPDATE "minuts" SET "title" = ?, "updated_at" = ? WHERE "minuts"."id" = 3  [["title", "aaa"], ["updated_at", "2015-02-17 06:05:27.399362"]]
---
  def update
    respond_to do |format|
      if @minut.update(minut_params)

DELETE FROM "minuts" WHERE "minuts"."id" = ?  [["id", 1]]
---
  def destroy
    @minut.destroy

SELECT  "minuts".* FROM "minuts"  WHERE "minuts"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_minut
      @minut = Minut.find(params[:id])