app/controllers/minuti_details_controller.rb

  def index
    @minuti_details = MinutiDetail.all
---
SELECT "minuti_details".* FROM "minuti_details"