app/controllers/users_controller.rb

SELECT "groups".* FROM "groups"
---
  def new
    @user = User.new
    @user.groups.build

SELECT "groups".* FROM "groups"
---
  def edit
     @group = Group.all

INSERT INTO "users" ("created_at", "updated_at", "user_id", "user_mail", "user_name") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-17 06:00:32.776708"], ["updated_at", "2015-02-17 06:00:32.776708"], ["user_id", 1], ["user_mail", "test@test.test"], ["user_name", "テストユーザー"]]
---
  def create
    @user = User.new(user_params)

    gparams = params.require(:user).require(:group_users).permit(:id)
    group = Group.find(gparams[:id].to_i)
    @user.groups << group

UPDATE "users" SET "updated_at" = ?, "users_mail" = ?, "users_name" = ? WHERE "users"."id" = 1  [["updated_at", "2015-01-20 08:21:01.769828"], ["users_mail", "test@test.com"], ["users_name", "test"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)